[
  {
    "title": "Meetup",
    "headers": ["What is Meetup?", "Tech Stack"],
    "paragraphs": [
      "Meetup is a mobile app that connects high school students based on similar interests. It was created during 2020 to solve the problem of depression among teenagers who, because of COVID, were not able to have social interactions as they would during a normal school year. By providing a platform where students can connect with each other based on shared interests, we can overcome COVID together.",
      "The frontend is built with React Native for cross-platform development, Expo (a RN wrapper) for quicker and easier development, and Firebase for backend connections."
    ],
    "github": [
      {"name": "Frontend", "link": "https://github.com/wxue24/meetup"},
      {"name": "Backend", "link": "https://github.com/wxue24/meetup-functions"}
      
    ]
  },
  {
    "title": "Project Eto",
    "headers": ["What is Project Eto?", "Tech Stack"],
    "paragraphs": [
      "Project Eto is a holistic peer-tutoring solution for the education crisis in high schools around the country. As part of a team of college entrepreneurs, I am developing mobile and web apps that will assist schools in implementing our program. The mobile app allows students and tutors to sign up for sessions, while the web app acts as an administrative dashboard and provides the necessary analytics to the program managers.",
      "The mobile app will be built with React Native + Expo, while the web app React. I am currently using firebase for the backend, but may migrate to a SQL database in the future due to the querying requirements of our app."
    ],
    "github": ["https://github.com/wxue24/peer-tutoring-backend"]
  },
  {
    "title": "Personal Site",
    "headers": ["Tech Stack"],
    "paragraphs": [
      "Built with 11ty, a simple static site generator, and TailwindCSS, a utility first CSS framework. Currently, this site is not very impressive, but I hope to continue adding on to it as I learn more about web development!"
    ],
    "github": ["https://github.com/wxue24/personal_site"]
  }
]
